In [1]:
import pandas as pd
import numpy as np

#Q6) You have the following DataFrame:
Name	Team	Salary	Profit
A	X	50000	45
B	X	55000	30
C	Y	52000	60
D	Y	53000	25
Write Python code to:
1	Group the data by Team
2	Calculate average salary and total profit for each team
3	Display the result

In [2]:
data={"Name":["A","B","C","D"],"Team":["X","X","Y","Y"],"Salary":[50000,55000,52000,53000],"Profit":[45,30,60,25]}
data

{'Name': ['A', 'B', 'C', 'D'],
 'Team': ['X', 'X', 'Y', 'Y'],
 'Salary': [50000, 55000, 52000, 53000],
 'Profit': [45, 30, 60, 25]}

In [3]:
df=pd.DataFrame(data)
df

  Name Team  Salary  Profit
0    A    X   50000      45
1    B    X   55000      30
2    C    Y   52000      60
3    D    Y   53000      25

In [4]:
#Q6)1)

In [17]:
grouped=df.groupby("Team")
grouped

In [ ]:
#Q6)2)

In [18]:
average_salary=df.groupby("Team")["Salary"].mean()
average_salary

Team
X    52500.0
Y    52500.0
Name: Salary, dtype: float64

In [20]:
#OR

In [22]:
average_salary=grouped["Salary"].mean()
average_salary

Team
X    52500.0
Y    52500.0
Name: Salary, dtype: float64

In [26]:
average_profit=df.groupby("Team")["Profit"].sum()
average_profit

Team
X    75
Y    85
Name: Profit, dtype: int64

In [ ]:
#OR

In [34]:
total_profit=grouped["Profit"].sum()
total_profit

Team
X    75
Y    85
Name: Profit, dtype: int64

In [35]:
#Q6)3)

In [38]:
result=pd.DataFrame({"Average_Salary":average_salary,"Total_Profit":total_profit})
result

      Average_Salary  Total_Profit
Team
X            52500.0            75
Y            52500.0            85

#Q7 Given:

df = pd.DataFrame({
    'Name': ['A','B','C','D'],
    'Score1': [40, 55, 70, 30],
    'Score2': [50, 65, 75, 35]
})
Write code to:
1	Select only the rows where Score1 > 40 AND Score2 > 50
2	Create a new column AverageScore = mean of Score1 and Score2
3	Display only the names and the new column

In [40]:
score=pd.DataFrame({"Name":["A","B","C","D"],"Score1":[40, 55, 70, 30],"Score2":[50, 65, 75, 35]})
score

  Name  Score1  Score2
0    A      40      50
1    B      55      65
2    C      70      75
3    D      30      35

In [39]:
#Q7)1)

In [42]:
score[(score["Score1"]>40) & (score["Score2"]>50)]

  Name  Score1  Score2
1    B      55      65
2    C      70      75

In [50]:
score["Average_Score"]=score[["Score1","Score2"]].mean(axis=1)
score

  Name  Score1  Score2  AverageScore  Average_Score
0    A      40      50          50.0           45.0
1    B      55      65          65.0           60.0
2    C      70      75          75.0           72.5
3    D      30      35          35.0           32.5

In [51]:
#double brackets because of the default [] plus there are two score columns to consider, thus it needs to be in a list hence [[]]

In [52]:
print(filtered[["Name","Average_Score"]])

NameError: name 'filtered' is not defined